vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32WBAxx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.7.36" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.36/schema/PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32WBAxx_DFP</name>
  <description overview="Documents/OVERVIEW.md">STMicroelectronics STM32WBA Series Device Support</description>
  <url>https://www.keil.com/pack/</url>
  <repository type="git">https://github.com/Open-CMSIS-Pack/STM32WBAxx_DFP.git</repository>
  <license>LICENSE</license>
  <licenseSets>
    <licenseSet id="all" default="true" gating="true">
      <license title="Apache-2.0 License for CMSIS add-ons" name="LICENSE" spdx="Apache-2.0"/>
    </licenseSet>
  </licenseSets>

  <releases>
    <release version="2.1.0" date="2025-09-25" tag="v2.1.0">
      Updated documentation references
      Updated Templates:
      - Added DWARF-5 debug information
      - Added generated output files
      Package Description (pdsc):
      - Reorganized Flash and SRAM memory regions
      - Shortened device family description
    </release>
    <release version="2.0.0" date="2025-02-28" tag="v2.0.0">
      Updated for new CMSIS-Toolbox CubeMX integration
      Removed CMSIS Drivers
      Removed STM32Cube_FW_WBA
      Removed previous generator (gpdsc)
      Added new global generator
      Updated SVD files
      Package Description (pdsc):
      - Updated STM32WBA50xExx/52xExx/54xExx/55xExx device list
      - Added support for STM32WBA5Mxx/6xx devices
      - Removed Device:Startup component
      - Removed Device:STM32Cube HAL components
      - Removed Device:STM32Cube LL components
      - Removed compile device header from device description
      - Removed unused conditions
      - Updated memories regions
      - Replaced documentation files with permalinks
    </release>
    <release version="1.3.0" date="2024-04-30">
      Updated STM32Cube FW to STM32Cube_FW_WBA_V1.3.0 (HAL V1.3.0).
      Added LICENSE file
      Device support:
      - Added STM32WBA50, STM32WBA54, STM32WBA55 device subfamilies, aligned with CubeMX V6.11.0
      - Updated documentation
      - Updated SVD files.
    </release>
    <release version="1.2.1" date="2023-07-20">
      Device Support:
      - Updated public devices
    </release>
    <release version="1.2.0" date="2023-05-31">
      Devices Support:
      - Added CubeMX support
      - Added Data sheets, reference manuals
    </release>
    <release version="1.1.0" date="2023-03-10">
      Initial public release based on STM32Cube_FW_WBA Firmware Package version V1.0.0
    </release>
    <!-- non-public history
      version 1.0.0:
      Updated Pack to STM32Cube_FW_WBA Firmware Package version V0.3.0:
      - Updated CMSIS device
      - adding spport to STM32WBA52 SVD file
      - Updated Documentation.

      version 0.0.1:
      First release:
      - STM32WBA55x/WBA54x/WBA52x/WBA50x Subfamilies support
      - Internal Flash loader support
     -->
  </releases>

  <keywords>
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32WBA</keyword>
    <keyword>STM32WBAx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32WBA Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M33" DcoreVersion="r0p0" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="100000000"/>

      <description>
Ultra-low-power wireless STM32WBA MCUs with Arm Cortex-M33 core, MPU, cache, DSP, FPU, 150 DMIPS at 100 MHz.
      </description>

      <book name="https://developer.arm.com/documentation/100235/latest/" title="Cortex-M33 Generic User Guide"/>

      <!-- ************************  Subfamily 'STM32WBA50'  ************************** -->
      <subFamily DsubFamily="STM32WBA50">
        <processor Dtz="TZ"/>
        <debug svd="CMSIS/SVD/STM32WBA50.svd"/>
        <compile define="STM32WBA50xx"/>

        <!-- ################################### 1MB ################################## -->
        <!-- *************************  Device 'STM32WBA50KGUx'  ********************** -->
        <device Dname="STM32WBA50KGUx">
          <memory name="Flash" access="rx"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="SRAM1" access="rwx"                     start="0x20000000" size="0x00004000" default="1"/>
          <memory name="SRAM2" access="rwx"                     start="0x20010000" size="0x0000C000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32WBA50KGUxT'  ********************* -->
        <device Dname="STM32WBA50KGUxT">
          <memory name="Flash" access="rx"                      start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="SRAM1" access="rwx"                     start="0x20000000" size="0x00004000" default="1"/>
          <memory name="SRAM2" access="rwx"                     start="0x20010000" size="0x0000C000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="32"/>
        </device>

        <!-- ################################### 512KB ################################ -->
        <!-- *************************  Device 'STM32WBA50KEUx'  ********************** -->
        <device Dname="STM32WBA50KEUx">
          <memory name="Flash" access="rx"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="SRAM1" access="rwx"                     start="0x20000000" size="0x00004000" default="1"/>
          <memory name="SRAM2" access="rwx"                     start="0x20010000" size="0x0000C000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="32"/>
        </device>

