vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32WBAxx_DFP.pdsc
        <!-- *************************  Device 'STM32WBA50KEUxT'  ********************* -->
        <device Dname="STM32WBA50KEUxT">
          <memory name="Flash" access="rx"                      start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="SRAM1" access="rwx"                     start="0x20000000" size="0x00004000" default="1"/>
          <memory name="SRAM2" access="rwx"                     start="0x20010000" size="0x0000C000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="32"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32WBA52'  ************************** -->
      <subFamily DsubFamily="STM32WBA52">
        <processor Dtz="TZ"/>
        <compile define="STM32WBA52xx"/>
        <debug svd="CMSIS/SVD/STM32WBA52.svd"/>

        <book name="https://www.st.com/resource/en/reference_manual/rm0493-multiprotocol-wireless-bluetooth-lowenergy-and-ieee802154-stm32wba5xxx-armbased-32bit-mcus-stmicroelectronics.pdf" title="STM32WBA52xx Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32wba52ce.pdf" title="STM32WBA52xx Data Sheet"/>

        <!-- ################################### 1MB ################################## -->
        <!-- *************************  Device 'STM32WBA52CGUx'  ********************** -->
        <device Dname="STM32WBA52CGUx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00010000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32WBA52CGUxT'  ********************* -->
        <device Dname="STM32WBA52CGUxT">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00010000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32WBA52CGUxU'  ********************* -->
        <device Dname="STM32WBA52CGUxU">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00010000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32WBA52KGUx'  ********************** -->
        <device Dname="STM32WBA52KGUx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00010000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32WBA52KGUxT'  ********************* -->
        <device Dname="STM32WBA52KGUxT">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00010000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="32"/>
        </device>

