vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32WBAxx_DFP.pdsc
        <!-- *************************  Device 'STM32WBA55HGFx'  ********************** -->
        <device Dname="STM32WBA55HGFx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00010000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="CSP" n="41"/>
        </device>

        <!-- *************************  Device 'STM32WBA55UGIxT'  ********************* -->
        <device Dname="STM32WBA55UGIxT">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00010000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="BGA" n="59"/>
        </device>

        <!-- ################################### 512KB ################################ -->
        <!-- *************************  Device 'STM32WBA55CEUx'  ********************** -->
        <device Dname="STM32WBA55CEUx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00008000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00008000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32WBA55CEUxT'  ********************* -->
        <device Dname="STM32WBA55CEUxT">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00008000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00008000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32WBA55UEIx'  ********************** -->
        <device Dname="STM32WBA55UEIx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00008000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00008000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="BGA" n="59"/>
        </device>

        <!-- *************************  Device 'STM32WBA55UEIxT'  ********************* -->
        <device Dname="STM32WBA55UEIxT">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00008000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00008000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="BGA" n="59"/>
        </device>

        <!-- *************************  Device 'STM32WBA55HEFx'  ********************** -->
        <device Dname="STM32WBA55HEFx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00080000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00080000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00008000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00008000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="CSP" n="41"/>
        </device>
      </subFamily>

