vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32WBAxx_DFP.pdsc
      <!-- ************************  Subfamily 'STM32WBA5M''  ************************* -->
      <subFamily DsubFamily="STM32WBA5M">
        <processor Dtz="TZ"/>
        <debug svd="CMSIS/SVD/STM32WBA55.svd"/>
        <compile define="stm32WBA55xx"/>

        <!-- ################################### 1MB ################################## -->
        <!-- *************************  Device 'STM32WBA5MJGHxU'  ********************* -->
        <device Dname="STM32WBA5MJGHxU">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00010000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
        </device>

       <!-- *************************  Device 'STM32WBA5MJGHx'  *********************** -->
       <device Dname="STM32WBA5MJGHx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00010000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20010000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30010000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32WBA62'  ************************** -->
      <subFamily DsubFamily="STM32WBA62">
        <processor Dtz="TZ"/>
        <debug svd="CMSIS/SVD/STM32WBA62.svd"/>
        <compile define="stm32WBA62xx"/>

        <!-- ################################### 2MB ################################## -->
        <!-- *************************  Device 'STM32WBA62MIFx'  ********************** -->
        <device Dname="STM32WBA62MIFx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00200000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00070000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00070000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0800.FLM"   start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0C00.FLM"   start="0x0C000000" size="0x00200000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="CSP" n="88"/>
        </device>
        <!-- *************************  Device 'STM32WBA62CIUx'  ********************** -->
        <device Dname="STM32WBA62CIUx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00200000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00070000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00070000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0800.FLM"   start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0C00.FLM"   start="0x0C000000" size="0x00200000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32WBA62PIIx'  ********************** -->
        <device Dname="STM32WBA62PIIx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00200000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00070000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00070000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0800.FLM"   start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0C00.FLM"   start="0x0C000000" size="0x00200000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="BGA" n="121"/>
        </device>
        <!-- ################################### 1MB ################################## -->
        <!-- *************************  Device 'STM32WBA62CGUx'  ********************** -->
        <device Dname="STM32WBA62CGUx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00030000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00030000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32WBA62MGFx'  *********************** -->
        <device Dname="STM32WBA62MGFx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00030000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00030000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="CSP" n="88"/>
        </device>
        <!-- *************************  Device 'STM32WBA62PGIx'  ********************** -->
        <device Dname="STM32WBA62PGIx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00030000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00030000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="BGA" n="121"/>
        </device>
      </subFamily>

