vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32WBAxx_DFP.pdsc
        <!-- ************************  Subfamily 'STM32WBA63'  ************************ -->
      <subFamily DsubFamily="STM32WBA63">
        <processor Dtz="TZ"/>
        <debug svd="CMSIS/SVD/STM32WBA63.svd"/>
        <compile define="stm32WBA63xx"/>
          
        <!-- ################################### 2MB ################################## -->
        <!-- *************************  Device 'STM32WBA63CIUx'  ********************** -->
        <device Dname="STM32WBA63CIUx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00200000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00070000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00070000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0800.FLM"   start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0C00.FLM"   start="0x0C000000" size="0x00200000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>
        <!-- ################################### 1MB ################################## -->
        <!-- *************************  Device 'STM32WBA63CGUx'  ********************** -->
        <device Dname="STM32WBA63CGUx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00200000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00070000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00070000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32WBA64'  ************************** -->
      <subFamily DsubFamily="STM32WBA64">
        <processor Dtz="TZ"/>
        <debug svd="CMSIS/SVD/STM32WBA64.svd"/>
        <compile define="stm32WBA64xx"/>
         
        <!-- ################################### 2MB ################################## -->
        <!-- *************************  Device 'STM32WBA64CIUx'  ********************** -->
        <device Dname="STM32WBA64CIUx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00200000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00070000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00070000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0800.FLM"   start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0C00.FLM"   start="0x0C000000" size="0x00200000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>
        <!-- ################################### 1MB ################################## -->
        <!-- *************************  Device 'STM32WBA64CGUx'  ********************** -->
        <device Dname="STM32WBA64CGUx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00200000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00070000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00070000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32WBA65'  ************************** -->
      <subFamily DsubFamily="STM32WBA65">
        <processor Dtz="TZ"/>
        <debug svd="CMSIS/SVD/STM32WBA65.svd"/>
        <compile define="stm32WBA65xx"/>

        <!-- ################################### 2MB ################################## -->
        <!-- *************************  Device 'STM32WBA65CIUx'  ********************** -->
        <device Dname="STM32WBA65CIUx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00200000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00070000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00070000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0800.FLM"   start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0C00.FLM"   start="0x0C000000" size="0x00200000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32WBA65RIVx'  ********************** -->
        <device Dname="STM32WBA65RIVx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00200000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00070000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00070000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0800.FLM"   start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0C00.FLM"   start="0x0C000000" size="0x00200000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="68"/>
        </device>
        <!-- *************************  Device 'STM32WBA65MIFx'  ********************** -->
        <device Dname="STM32WBA65MIFx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00200000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00070000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00070000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0800.FLM"   start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0C00.FLM"   start="0x0C000000" size="0x00200000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="CSP" n="88"/>
        </device>
        <!-- *************************  Device 'STM32WBA65PIIx'  ********************** -->
        <device Dname="STM32WBA65PIIx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00200000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00070000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00070000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0800.FLM"   start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_2M_0C00.FLM"   start="0x0C000000" size="0x00200000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="BGA" n="121"/>
        </device>
        <!-- ################################### 1MB ################################## -->
        <!-- *************************  Device 'STM32WBA65CGUx'  ********************** -->
        <device Dname="STM32WBA65CGUx">
          <memory name="Flash_NS" access="rx"  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <memory name="Flash_S"  access="rx"  start="0x0C000000" size="0x00100000" alias="Flash_NS" />
          <memory name="SRAM1_NS" access="rwx" start="0x20000000" size="0x00030000" default="1" init="0" />
          <memory name="SRAM1_S"  access="rwx" start="0x30000000" size="0x00030000" alias="SRAM1_NS" />
          <memory name="SRAM2_NS" access="rwx" start="0x20070000" size="0x00010000" default="1" init="0" />
          <memory name="SRAM2_S"  access="rwx" start="0x30070000" size="0x00010000" alias="SRAM2_NS" />
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0800.FLM"   start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <algorithm name="CMSIS/Flash/STM32WBAx_1M_0C00.FLM"   start="0x0C000000" size="0x00100000" RAMstart="0x30000000" RAMsize="0x8000" default="1"/>
          <feature type="QFP" n="48"/>
        </device>
